motivation_videos = [
   'https://vkvideo.ru/video-96547297_456242096',
   'https://vkvideo.ru/clip497946239_456239722',
   'https://vk.com/video-185117189_456242467?list=203741944be79f8642',
   'https://vkvideo.ru/video204726522_456239890',
   'https://vkvideo.ru/clip497946239_456239722'
   'https://vksport.vkvideo.ru/video-216257332_456239558',
   'https://vkvideo.ru/video56595220_456239741',
   'https://vkvideo.ru/clip-222478675_456239370',
   'https://vkvideo.ru/video-216257332_456239245',
   'https://vkvideo.ru/video266596089_456240669'
]

future_wishes = ["Можно поздравить тебя с почином =D. Первый блок пройден! Но еще предстоит долгая и интересная работа."
                 "Но хорошо, что с тобой есть я - твой куратор) Обязательно задавай все свои вопросы мне, я помогу "
                 "разобраться в задачах, в оформлении, решу непонятки с сайтом. Поэтому не стесняйся, обращайся ;)",

                 "Главное - не скорость, а понимание. Возвращайся к моим комментариям, вдумчиво разбирай"
                 " свои шаги. Эта работа - секрет твоего будущего успеха на экзамене",

                'Дерзай, только вперед! Не забывай смотреть на мои комментарии к решениям, '
                'набивай ошибки во время обучения, '
                'чтобы в полной мере научиться решать и оформлять задачи💯',

                'Вперёд - к новым вершинам! Внимательно изучай комментарии к решениям: '
                'в них - не просто правки и замечания, а шаги твоего роста. Ошибки сейчас = уверенность потом. Учись смело! 💯',

                'Продолжаем в том же духе, уже перешли экватор обучения - а значит осталась самая интересная, увлекательная часть! '
                'И в этой части обучения я по-прежнему с тобой. Иду и поддерживаю. Поэтому - двигаемся дальше к цели 💪',

                'Не останавливайся: дальше - только вперёд. Читай комментарии,'
                ' анализируй ошибки, отрабатывай оформление. Именно так строится настоящий навык решения задач 💯',

               'Продолжай в том же духе - физика не про «умный/неумный», а про «делаю/не делаю». Читай комментарии,'
                ' не пролетай мимо ошибок - именно в них прячется твой прогресс. А оформление? Это твой «почерк физика» - '
                'тренируй его, как музыкант тренирует гаммы 💯',

                'Полный газзз, только вперед!',

                'Вот и прошел заключительный блок курса. Быстро время пролетело. Осталось не так много до финала.'
                'Я уверен, за этот год все ты стал(а) сильнее, умнее и твердо подготовился(лась) к ЕГЭ.'
                ' Желаю тебе успехов на экзаменах, будь уверен(а) в своих силах)'
                ]

quotes = [
    "Привет, {name}! «Если вы обладаете знаниями, дайте другим зажечь от них свои светильники» — Т. Фуллер. "
    "Эти слова как нельзя лучше отражают, почему я здесь и зачем создан этот курс. Я сам прошёл весь"
    " этот путь подготовки к ЕГЭ: через сложные задачи, поиск решений и радость от понимания. Сдал экзамен "
    "успешно и теперь хочу стать для тебя тем самым проводником, который поможет зажечь твой собственный светильник знаний. "
    "Моя роль - не просто дать тебе информацию, а передать опыт: показать, как избежать типичных ошибок,"
    " как понять суть темы, а не просто заучить формулу, и как подойти к экзамену с уверенностью."
    " Я уже прошёл эту дорогу и теперь готов поделиться с тобой всем, что знаю сам — чтобы твой путь был понятнее и результативнее",

    "Привет, {name}! «Великое искусство научиться многому — это браться сразу за немногое» — писал Джон Локк."
    " Часто кажется, что для большого успеха нужен сразу же и большой рывок. Но настоящая мудрость — "
    "и в учебе, и в жизни — заключается в обратном. Попытка объять необъятное, выучить всё и сразу, только рассеивает внимание и приводит к выгоранию."
    "Великие знания строятся по кирпичику. "
    "Одна решённая задача в день — и к концу месяца ты уверенно щёлкаешь целый раздел."
    "Одна внимательно разобранная ошибка — и ты становишься опытнее, избегая будущих ловушек."
    "Одна аккуратно выведенная формула — и ты закладываешь фундамент для понимания сложных законов."
    "Не распыляйся. Сфокусируйся на маленьком, но конкретном шаге прямо сейчас. Разбери одну тему,"
    " проработай один тип задач, усвой один закон. Именно это последовательное, спокойное движение "
    "вперёд превращает неподъёмную гору знаний в путь, полный маленьких, но уверенных побед",

   "Привет, {name}! «Хмели сумели — и ты сможешь». Да-да, те самые хмели — не сорняки на грядке,"
   " а ваши коллеги - бывшие ученики Эбонита, которые, как и вы, "
   "когда-то смотрели на задачу по физике и думали: «Ну это точно не для меня…». А потом взяли "
   "себя в руки, перерешали десятки, сотни примеров, переспросили у куратора — и вдруг поняли. "
   "Если они справились, то почему бы не вам? У вас — те же шансы и даже лучшие "
   "Так что не сомневайтесь: если «хмели» смогли"
   " — вы не просто сможете, вы сделаете это с размахом! 💪",


   "Привет, {name}! «Учеба — это как спорт: чем больше тренируешься, тем сильнее становишься». "
   "Как и в спорте, в физике нет волшебной кнопки, которая по щелчку пальца дарит понимание "
   "законов природы. Но зато есть регулярная практика — решение задач, повторение формул,"
   " разбор ошибок и постоянное стремление разобраться глубже в предмете. Каждое упражнение укрепляет "
   "не только знания, но и уверенность в себе. Чем чаще вы возвращаетесь к материалу, тем легче"
   " даются даже самые сложные темы. И со временем вы удивитесь, насколько далеко ушли — просто потому"
   " что не переставали тренироваться 😉 ",


   "Привет, {name}! «Рост начинается там, где заканчивается комфорт». Легко оставаться в зоне знакомого — решать только те задачи, "
   "которые уже понятны, избегать сложных тем и откладывать разбор непонятного «на потом». Но настоящий прогресс в "
   "физике (и в жизни тоже!) случается тогда, когда вы решаетесь выйти за пределы привычного: задать неудобный глупый вопрос,"
   " попробовать решить задачу, которая сначала кажется неподъёмной, или просто уделить ещё немного времени тому, что"
   " даётся с трудом. Именно в этих моментах — в напряжении, усилии, иногда даже в ошибке — и рождается настоящее"
   " понимание и уверенность. Не бойтесь зоны дискомфорта: это не тупик, а точка вашего роста 📈",

    "Привет, {name}!  «Сделайте каждый шаг сознательным и нацеленным на цель» - сказали мне на предмете <Софты для ИТ>. Учёба становится "
    "по-настоящему эффективной, когда вы не просто проходите материал, а чётко понимаете, "
    "зачем это делаете. Каждая решённая задача, каждая формула, каждый час размышлений — всё "
    "это не просто обязанность, а шаг к вашей цели: глубокому пониманию физики, успешной сдаче экзамена, "
    "поступлению в вуз мечты или даже открытию чего-то нового. Осознанность превращает рутину в движение "
    "вперёд. Прежде чем открыть тетрадь или начать смотреть новый веб спросите себя: «Как это приближает меня к моей цели? И Вообще какая моя цель?» "
    "— и вы удивитесь, насколько мощнее станет ваша учеба 📚",

    "Привет, {name}! «Когда вы убеждены в своих способностях, нет границ вашему росту»."
    " Физика — наука не только о законах Вселенной, но и о вере в себя. Многие великие открытия начинались "
    "не с готовых ответов, а с твёрдого убеждения: «Я могу разобраться». Когда вы верите, что способны понять "
    "сложное, преодолеть трудности и найти решение — вы уже на шаг впереди. Эта уверенность не означает, "
    "что всё будет легко, но она даёт силы не сдаваться, задавать вопросы, искать новые подходы и учиться"
    " на ошибках. И именно в этом пространстве — где смелость встречается с трудом — раскрывается ваш настоящий "
    "потенциал. Помните: границы существуют только до тех пор, пока вы в них верите 💡",

    "Привет, {name}! «Ваш потенциал бесконечен, если вы готовы верить в себя». В физике, как и в жизни, самый мощный закон "
    "— не F = ma, а «Я смогу». Потому что именно вера в свои силы запускает цепную реакцию: вы не боитесь сложных "
    "задач, не сдаётесь при первой неудаче и продолжаете искать решение, даже когда кажется, что энергия закончилась."
  " А ведь каждый студент топового технического вуза когда-то сидел над тетрадкой, грыз ручку и думал: «А вдруг у меня не получится?» Разница лишь "
   "в том, что он выбрал: «Попробую ещё раз». Так что помните: ваши возможности ограничены не формулами, не оценками и "
   "даже не количеством нейронов — а только тем, насколько сильно вы готовы доверять себе. А с такой установкой "
   "вы способны на гораздо больше, чем думаете! 🌟 ",


   "Привет, {name}!  «Самая большая награда — это смотреть назад и видеть, как вы преодолели трудности» "
   "Представьте себе момент, когда вы получите заветное письмо о зачислении в университет мечты."
   " За плечами — месяцы упорной подготовки, ночи над задачами, пересдачи пробников, "
   "моменты сомнений и усталости… Но вы не сдавались. Каждое вечер после школы, когда вы открывали "
   "вебчик вместо того, чтобы отложить «на потом», каждое усилие, вложенное в понимание, "
   "а не просто заучивание, — всё это вело вас к цели. И именно тогда, оглядываясь назад, "
   "вы поймёте: главная победа — не в баллах ЕГЭ и даже не в зачислении (хотя это, конечно, круто!),"
   " а в том, что вы поверили в себя настолько, что прошли через всё это. А это — награда, которую никто "
   "не сможет у вас отнять 🔥"
]
